import React, { Component } from 'react'

export default class Agreement extends Component {
    render(){
        return (
            <div>
                <article>
                    <h4>好学家用户注册协议</h4>
                    <h5>欢迎您使用好学家，请您在注册前仔细阅读本协议，本协议在您开始使用本网站，并成为网站的注册会员时即产生法律效力，好学家将依据以下条件和条款提供您所享有的服务。如您不同意本协议，您可以主动取消好学家提供的服务；您一旦使用好学家的服务，即视为您已了解并完全同意本协议各项内容。</h5>
                    <dl>
                        <dt>1. 接受条款</dt>
                            <dd>通过首页进入www.haoxuehome.com网站即表示您同意自己已经与好学家订立本协议，且您将受本协议的条款和条件约束。好学家可随时自行全权决定更改“条款”。如“条款”有任何变更，好学家将在其网站上刊载公告，通知予您。如您不同意相关变更，必须停止使用“服务”。经修订的“条款”一经在好学家公布后，立即自动生效。您应在第一次登录后仔细阅读修订后的“条款”，并有权选择停止继续使用“服务”；一旦您继续使用“服务”，则表示您已接受经修订的“条款”，当您与好学家发生争议时，应以最新的服务协议为准。除另行明确声明外，任何使“服务”范围扩大或功能增强的新内容均受本协议约束。除非经好学家的授权高层管理人员签订书面协议，本协议不得另行作出修订。</dd>
                        <dt>2. 谁可使用www.haoxuehome.com？</dt>
                            <dd>“服务”仅供能够根据相关法律订立具有法律约束力的合约的个人或公司使用。因此，您的年龄必须在十八周岁或以上，才可使用好学家服务。如不符合本项条件，请勿使用“服务”。好学家可随时自行全权决定拒绝向任何人士提供“服务”。“服务”不会提供给被暂时或永久中止资格的好学家会员。</dd>
                        <dt>3. 收费</dt>
                            <dd>好学家保留在根据第1条通知您后，收取服务费用的权利。您因进行信息发布、向好学家获取有偿服务或接触好学家服务器而发生的所有应纳税赋，以及相关硬件、软件、通讯、网络服务及其他方面的费用均由您自行承担。好学家保留在无须发出书面通知，仅在好学家公示的情况下，暂时或永久地更改或停止部分或全部免费服务的权利。</dd>
                        <dt>4. 好学家仅作为商业信息服务提供场所</dt>
                            <dd>好学家仅作为用户寻找培训课程信息服务，以及获取各类教育培训信息提供一个快速的通道。但是，好学家不能控制信息所涉及的信息的质量、信誉、安全或合法性，学校信息的真实性或准确性。</dd>
                        <dt>5. 注册会员的资料和信息发布</dt>
                            <dd>“您的资料”包括您在注册过程中、在任何公开信息场合或通过任何电子邮件形式，向好学家或其他用户提供的任何资料，包括数据、文本、软件、音乐、声响、照片、图画、影像、词句或其他材料。您应对“您的资料”负全部责任，而好学家仅作为您在网上发布和刊登“您的资料”的被动渠道。但是，倘若好学家认为“您的资料”可能使好学家承担任何法律或道义上的责任，或可能使好学家 (全部或部分地) 失去好学家的互联网服务供应商或其他供应商的服务，或您未在好学家规定的期限内登录或再次登录网站，则好学家可自行全权决定对“您的资料”采取好学家认为必要或适当的任何行动，包括但不限于删除该类资料。您特此保证，您对提交给好学家的“您的资料”拥有全部权利，包括全部版权。您确认，好学家没有责任去认定或决定您提交给好学家的资料哪些是应当受到保护的，对享有“服务”的其他用户使用“您的资料”，好学家也不必负责。</dd>
                        <dt>5.1 注册义务</dt>
                            <dd>如您在好学家注册，您同意： <br/>
                                (1) 提供关于您或贵公司的真实、准确、完整和反映当前情况的资料； <br/>
                                (2) 维持并及时更新会员资料，使其保持真实、准确、完整和反映当前情况。倘若您提供任何不真实、不准确、不完整或不能反映当前情况的资料，或好学家有合理理由怀疑该等资料不真实、不准确、不完整或不能反映当前情况，好学家有权暂停或终止您的注册身份及资料，并拒绝您在目前或将来对“服务”(或其任何部份) 以任何形式使用。如您代表一家公司或其他法律主体在好学家登记，则您声明和保证，您有权使该公司或其他法律主体受本协议“条款”约束。</dd>
                        <dt>5.2 会员注册名、密码和保密。</dt>
                            <dd>在登记过程中，您将选择会员注册名和密码。您须自行负责对您的会员注册名和密码保密，且须对您在会员注册名和密码下发生的所有活动承担责任。您同意： <br/>
                                (1) 如发现任何人未经授权使用您的会员注册名或密码，或发生违反保密规定的任何其他情况，您会立即通知好学家； <br/>
                                (2) 确保您在每个上网时段结束时，以正确步骤离开网站。好学家不能也不会对因您未能遵守本款规定而发生的任何损失或损毁负责。 </dd>
                        <dt>5.3 关于您的资料的规则</dt>
                            <dd>您同意，“您的资料”和您供在好学家网站上交易的任何“物品”（泛指一切可供依法交易的、有形的或无形的、以各种形态存在的某种具体的物品，或某种权利或利益，或某种票据或证券，或某种服务或行为。本协议中“物品”一词均含此义） <br/>
                                (1). 不会有欺诈成份，与售卖伪造或盗窃无涉； <br/>
                                (2). 不会侵犯任何第三者对该物品享有的物权，或版权、专利、商标、商业秘密或其他知识产权，或隐私权、名誉权； <br/>
                                (3). 不会违反任何法律、法规、条例或规章 (包括但不限于关于规范出口管理、贸易配额、保护消费者、不正当竞争或虚假广告的法律、法规、条例或规章)； <br/>
                                (4). 不会含有诽谤（包括商业诽谤）、非法恐吓或非法骚扰的内容； <br/>
                                (5). 不会含有淫秽、或包含任何儿童色情内容； <br/>
                                (6). 不会含有蓄意毁坏、恶意干扰、秘密地截取或侵占任何系统、数据或个人资料的任何病毒、伪装破坏程序、电脑蠕虫、定时程序炸弹或其他电脑程序； <br/>
                                (7). 不会直接或间接与下述各项货物或服务连接，或包含对下述各项货物或服务的描述：本协议项下禁止的货物或服务；或您无权连接或包含的货物或服务。此外，您同意不会： 在与任何连锁信件、大量胡乱邮寄的电子邮件、滥发电子邮件或任何复制或多余的信息有关的方面使用“服务”； <br/>
                                (8) 未经其他人士同意，利用“服务”收集其他人士的电子邮件地址及其他资料；或利用“服务”制作虚假的电子邮件地址，或以其他形式试图在发送人的身份或信息的来源方面误导其他人士。</dd>
                        <dt>5.4 被禁止信息</dt>
                            <dd>您不得在好学家公布或通过好学家发布： <br/>
                                (1) 可能使好学家违反任何相关法律、法规、条例或规章的任何物品和服务信息； <br/>
                                (2) 好学家认为应禁止或不适合通过本网站发布的任何物品和服务信息。</dd>
                        <dt>6. 您授予好学家的许可使用权</dt>
                            <dd>您授予好学家独家的、全球通用的、永久的、免费的许可使用权利 (并有权在多个层面对该权利进行再授权)，使好学家有权(全部或部份地) 使用、复制、修订、改写、发布、翻译、分发、执行和展示"您的资料"或制作其派生作品，和/或以现在已知或日后开发的任何形式、媒体或技术，将"您的资料"纳入其他作品内。</dd>
                        <dt>7.隐私</dt>
                            <dd>尽管有第6条所规定的许可使用权，好学家将仅根据好学家的隐私声明使用“您的资料”。好学家隐私声明的全部条款属于本协议的一部份，因此，您必须仔细阅读。请注意，您一旦自愿地在好学家交易地点披露“您的资料”，该等资料即可能被其他人士获取和使用。</dd>
                        <dt>8. 终止或访问限制</dt>
                            <dd>您同意，在好学家未向您收费的情况下，好学家可自行全权决定以任何理由 (包括但不限于好学家认为您已违反本协议的字面意义和精神，或您以不符合本协议的字面意义和精神的方式行事，或您在超过90天的时间内未以您的帐号及密码登录网站) 终止您的“服务”密码、帐户 (或其任何部份) 或您对“服务”的使用，并删除和丢弃您在使用“服务”中提交的 “您的资料”。您同意，在好学家向您收费的情况下，好学家应基于合理的怀疑且经电子邮件通知的情况下实施上述终止服务的行为。好学家同时可自行全权决定，在发出通知或不发出通知的情况下，随时停止提供“服务”或其任何部份。您同意，根据本协议的任何规定终止您使用“服务”之措施可在不发出事先通知的情况下实施，并承认和同意，好学家可立即使您的帐户无效，或撤销您的帐户以及在您的帐户内的所有相关资料和档案，和/或禁止您进一步接入该等档案或“服务”。帐号终止后，好学家没有义务为您保留原帐号中或与之相关的任何信息，或转发任何未曾阅读或发送的信息给您或第三方。此外，您同意，好学家不会就终止您接入“服务”而对您或任何第三者承担任何责任。第10、11、12和20各条应在本协议终止后继续有效。</dd>
                        <dt>9. 违反规则会有什么后果？</dt>
                            <dd>在不限制其他补救措施的前提下，发生下述任一情况，好学家可立即发出警告，暂时中止、永久中止或终止您的会员资格，删除您的任何现有产品信息，以及您在网站上展示的任何其他资料： <br/>
                                (1) 您违反本协议； <br/>
                                (2) 好学家无法核实或鉴定您向好学家提供的任何资料； <br/>
                                (3) 好学家相信您的行为可能会使您、好学家用户或通过好学家或好学家网站提供服务的第三者服务供应商发生任何法律责任。在不限制任何其他补救措施的前提下，倘若发现您从事涉及好学家网站的诈骗活动，好学家可暂停或终止您的帐户。 
                            </dd>
                        <dt>10. 服务“按现状”提供</dt>
                            <dd>好学家会尽一切努力使您在使用好学家的过程中得到满意。但也可能遗憾的是，好学家不能随时预见到任何技术上的问题或其他困难。该等困难可能会导致数据损失或其他服务中断。为此，您明确理解和同意，您使用“服务”的风险由您自行承担。“服务”以“按现状”和“按可得到”的基础提供。好学家明确声明不作出任何种类的所有明示或暗示的保证，包括但不限于关于适销性、适用于某一特定用途和无侵权行为等方面的保证。好学家对下述内容不作保证： <br/>
                                (1)“服务”会符合您的要求； <br/>
                                (2)“服务”不会中断，且适时、安全和不带任何错误； <br/>
                                (3) 通过使用“服务”而可能获取的结果将是准确或可信赖的； <br/>
                                (4) 您通过“服务”而购买或获取的任何产品、服务、资料或其他材料的质量将符合您的预期。通过使用“服务”而下载或以其他形式获取任何材料是由您自行全权决定进行的，且与此有关的风险由您自行承担，对于因您下载任何该等材料而发生的您的电脑系统的任何损毁或任何数据损失，您将自行承担责任。您从好学家或通过或从“服务”获取的任何口头或书面意见或资料，均不产生未在本协议内明确载明的任何保证。</dd>
                        <dt>11. 责任范围</dt>
                            <dd>您明确理解和同意，好学家不对因下述任一情况而发生的任何损害赔偿承担责任，包括但不限于利润、商誉、使用、数据等方面的损失或其他无形损失的损害赔偿 (无论好学家是否已被告知该等损害赔偿的可能性)： <br/>
                                (1) 使用或未能使用“服务”； <br/>
                                (2) 因通过或从“服务”购买或获取任何货物、样品、数据、资料或服务，或通过或从“服务”接收任何信息或缔结任何交易所产生的获取替代货物和服务的费用； <br/>
                                (3) 未经批准接入或更改您的传输资料或数据； <br/>
                                (4) 任何第三者对“服务”的声明或关于“服务”的行为； <br/>
                                (5) 因任何原因而引起的与“服务”有关的任何其他事宜，包括疏忽。 
                            </dd>
                        <dt>12. 赔偿</dt>
                            <dd>您同意，因您违反本协议或经在此提及而纳入本协议的其他文件，或因您违反了法律或侵害了第三方的权利，而使第三方对好学家及其子公司、分公司、董事、职员、代理人提出索赔要求（包括司法费用和其他专业人士的费用），您必须赔偿给好学家及其子公司、分公司、董事、职员、代理人，使其等免遭损失。</dd>
                        <dt>13. 遵守法律</dt>
                            <dd>您应遵守与您使用“服务”，以及与您竞买、购买和销售任何物品以及提供商贸信息有关的所有相关的法律、法规、条例和规章。</dd>
                        <dt>14. 广告和金融服务</dt>
                            <dd>您与在“服务”上或通过“服务”物色的刊登广告人士通讯或进行业务往来或参与其推广活动，包括就相关货物或服务付款和交付相关货物或服务，以及与该等业务往来相关的任何其他条款、条件、保证或声明，仅限于在您和该刊登广告人士之间发生。您同意，对于因任何该等业务往来或因在“服务”上出现该等刊登广告人士而发生的任何种类的任何损失或损毁，好学家无需负责或承担任何责任。您如打算通过“服务”创设或参与与任何公司、股票行情、投资或证券有关的任何服务，或通过“服务”收取或要求与任何公司、股票行情、投资或证券有关的任何新闻信息、警戒性信息或其他资料，敬请注意，好学家不会就通过“服务”传送的任何该等资料的准确性、有用性或可用性、可获利性负责或承担任何责任，且不会对根据该等资料而作出的任何交易或投资决策负责或承担任何责任。</dd>
                        <dt>15. 链接</dt>
                            <dd>“服务”或第三者均可提供与其他万维网网站或资源的链接。由于好学家并不控制该等网站和资源，您承认并同意，好学家并不对该等外在网站或资源的可用性负责，且不认可该等网站或资源上或可从该等网站或资源获取的任何内容、宣传、产品、服务或其他材料，也不对其等负责或承担任何责任。您进一步承认和同意，对于任何因使用或信赖从此类网站或资源上获取的此类内容、宣传、产品、服务或其他材料而造成（或声称造成）的任何直接或间接损失，好学家均不承担责任。</dd>
                        <dt>16. 不可抗力</dt>
                            <dd>对于因好学家合理控制范围以外的原因，包括但不限于自然灾害、罢工或骚乱、物质短缺或定量配给、暴动、战争行为、政府行为、通讯或其他设施故障或严重伤亡事故等，致使好学家延迟或未能履约的，好学家不对您承担任何责任。</dd>
                        <dt>17. 转让</dt>
                            <dd>好学家转让本协议无需经您同意。</dd>
                        <dt>18. 其他规定</dt>
                            <dd>本协议构成您和好学家之间的全部协议，规定了您对“服务”的使用，并取代您和好学家先前订立的任何书面或口头协议。本协议各方面应受中华人民共和国大陆地区法律的管辖。倘若本协议任何规定被裁定为无效或不可强制执行，该项规定应被撤销，而其余规定应予执行。条款标题仅为方便参阅而设，并不以任何方式界定、限制、解释或描述该条款的范围或限度。好学家未就您或其他人士的某项违约行为采取行动，并不表明好学家撤回就任何继后或类似的违约事件采取行动的权利。</dd>
                        <dt>19. 诉讼</dt>
                            <dd>因本协议或好学家服务所引起或与其有关的任何争议应向好学家总部所在地人民法院提起诉讼，并以中华人民共和国法律为管辖法律。</dd>
                        <dt>好学家网站声明</dt>
                            <dd>好学家及本网页内的资料提供者拥有此网页内相应资料的版权。未经好学家的明确书面许可，任何人不得复制或在非好学家所属的服务器上做镜像。好学家所有权及知识产权属好学家所有，好学家保留所有追究法律责任的权利。</dd>
                        <dt>商标声明</dt>
                            <dd>好学家所提到的真实的公司和产品的名称可能是其各自所有者的商标。本网站所例举的公司、机构、产品、人士和事件是虚构的，不应认定或推断为任何实际公司、机构、产品、人士或事件。未经本公司明确授予的任何权利均予保留。</dd>
                        <dt>隐私声明</dt>
                            <dd>我们以本隐私声明对访问者隐私保护的许诺。以下文字公开我站（www.www.haoxuehome.com）对信息收集和使用的情况。本站的隐私声明正在不断改进中，随着我站服务范围的扩大，我们会随时更新我们的隐私声明。我们欢迎您随时会来查看本声明。请向好学家反馈您的意见。 <br/>
                                好学家服务协议（“协议”）之时，你已经同意我们按照本隐私声明来使用和披露您的个人信息。本隐私声明的全部条款属于该协议的一部份。</dd>
                        <dt>用户名和密码</dt>
                            <dd>当您打算注册成会员后，我们要求您选择一个用户名和密码，还要提供密码提示问题及其答案以便在您丢失密码后我们可以确认您的身份。您只能通过您的密码来使用您的帐号。如果您泄漏了密码，您可能丢失了您的个人识别信息，并且有可能导致对您不利的司法行为。因此不管任何原因使您的密码安全受到危及，您应该立即和我们取得联系。</dd>
                        <dt>注册信息</dt>
                            <dd>当您在注册为会员时，我们要求您填写一张注册表。注册表要求提供您的真实姓名，地址，国籍，电话号码，和电子邮件地址。另外，您还被要求提供您的公司的地址，电话号码和贵公司的服务和产品的简短说明。您还有权选择来填写附加信息。这些信息可能包括您公司所在的省份和城市，时区和邮政编码，传真号码，主页和您的职务。我们使用注册信息来获得会员的统计资料。我们将会用这些统计数据来给我们的会员分类，例如年龄、产业和国家，以便有针对性地向我们的会员提供新的服务和机会。我们会通过您的邮件地址来通知您这些新的服务和机会。</dd>
                        <dt>第三方</dt>
                            <dd>我们的网站公布了用户提交的商业信息，而其他用户可以查询这些商业信息。我们不会向任何第三方提供，出售，出租，分享和交易用户的个人信息，除非第三方和好学家一起为网站和会员提供服务并且在该服务结束后已将被禁止访问包括其以前能够访问的所有这些资料。当我们被法律强制或依照政府要求提供您的信息时我们将善意地披露您的资料。</dd>
                        <dt>外部链接</dt>
                            <dd>本站含有到其他网站的链接。好学家对那些网站的隐私保护措施不负任何责任。我们可能在任何需要的时候增加商业伙伴或共用品牌的网站，但是提供给他们的将仅仅是综合信息，我们将不会公开您的身份。</dd>
                        <dt>公开的交易信息</dt>
                            <dd>您提供发布的供贸易的物品信息或报价将被显示在公共区域，对任何用户来说是公开的。请注意所有在这些场所公开的信息会成为公共信息，请您在决定公布您的个人信息前仔细考虑。</dd>
                        <dt>安全</dt>
                            <dd>我们网站有相应的安全措施来确保我们掌握的信息不丢失，不被滥用和变造。这些安全措施包括向其它服务器备份数据和对用户密码加密。尽管我们有这些安全措施，但请注意在因特网上不存在“完善的安全措施”。</dd>
                        <dt>联系我们</dt>
                            <dd>如果你对本隐私声明或好学家的隐私保护措施以及您在使用中的问题有任何意见和建议，请和我们取得联系。</dd>
                        <dt>好学家法律声明</dt>
                            <dd>好学家提醒您：在使用好学家各项服务前，请您务必仔细阅读并透彻理解本声明。您可以选择不使用好学家，但如果您使用好学家，您的使用行为将被视为对本声明全部内容的认可。<br/>
                                鉴于好学家提供的服务属于电子信息公告牌服务，好学家上关于（www.haoxuehome.com）会员或其发布的相关信息（包括但不限于课程名称、机构名称、 联系人及联络信息，机构信息的描述和说明，相关图片、视讯等）的信息均由会员自行提供，会员依法应对其提供的任何信息承担全部责任。<br/>
                                好学家尊重并保护所有使用好学家用户的个人隐私权，您注册的用户名、电子邮件地址、手机电话等个人资料，除经您本人在好学家不限于通过在线留言、在线报名、客服选课、电话咨询等方式享受好学家提供的第三方推荐服务外，好学家不会主动地泄露给第三方（因政府执法部门、国家司法部门要求除外）。好学家提醒您：您在使用好学家提供的选课报名和搜索服务时输入的需求信息及关键字等将不被认为是您的个人隐私资料。<br/>
                                任何单位或个人认为好学家网页内容（包括但不限于好学家会员发布的信息）可能涉嫌侵犯其信息网络传播权，应该及时向好学家提出书面权利通知，并提供身份证明、权属证明、具体链接（URL）及详细侵权情况证明。好学家在收到上述法律文件后，将会依法尽快移除相关涉嫌侵权的内容。
                            </dd>
                        <dt>知识产权声明</dt>
                            <dd>好学家拥有本网站内所有信息内容（除好学家会员发布的商品信息外，包括但不限于文字、图片、软件、音频、视频）的版权。<br/>
                                任何被授权的浏览、复制、打印和传播属于本网站内信息内容都不得用于商业目的且所有信息内容及其任何部分的使用都必须包括此版权声明；<br/>
                                好学家（www.www.haoxuehome.com）所有的产品、技术与所有程序均属于好学家知识产权。“好学家”、好学家其他产品服务名称及相关图形、标识等为好学家的注册商标。未经好学家许可，任何人不得擅自（包括但不限于：以非法的方式复制、传播、展示、镜像、上载、下载）使用。否则，好学家将依法追究法律责任。
                            </dd>
                        <dt>隐私权声明</dt>
                            <dd>好学家非常重视对您隐私的保护，在您使用好学家提供的服务前，请您仔细阅读以下声明。为了给您提供更准确、更有个性化的服务，好学家可能会以如下方式，使用您提交的个人信息。但好学家会以高度的勤勉、审慎义务对待这些信息，在未征得您许可的情况下，不会将这些信息对外披露或向第三方提供。</dd>
                        <dt>保有您提供的信息</dt>
                            <dd>好学家会在您自愿选择服务或提供信息的情况下收集您的个人信息，并将这些信息进行整合，以便向您提供更好的用户服务。请您在注册时及时、详尽及准确的提供个人资料，并不断更新注册资料，符合及时、详尽准确的要求。如果因注册信息不真实而导致的问题，由您自行承担相应的后果。请您不要将您的帐号、密码转让或出借予他人使用。如您发现您的帐号遭他人非法使用，应立即通知好学家。因黑客行为或用户的保管疏忽导致帐号、密码遭他人非法使用，好学家不承担责任。</dd>
                        <dt>cookies等技术的使用</dt>
                            <dd>好学家使用cookies，以便您能登录我们的服务，并允许设定您特定的服务选项。运用cookies技术，好学家能够为您提供更加周到的个性化服务。您可以选择接受或拒绝cookies。您可以通过修改浏览器设置的方式拒绝cookies。如果您选择拒绝cookies，则您可能无法登录或使用依赖于cookies的好学家服务或功能。</dd>
                        <dt>保有您的使用记录</dt>
                            <dd>当您使用好学家提供的服务时，服务器会自动记录一些信息，包括URL、IP地址、浏览器的类型和使用的语言以及访问日期和时间等。<br/>
                                在如下情况下，好学家会根据您的意愿或法律的规定披露您的个人信息，由此引发的问题将由您个人承担：<br/>
                                （1）事先获得您的授权；<br/>
                                （2）只有透露您的个人资料，才能提供您所要求的产品和服务；<br/>
                                （3）根据有关的法律法规要求；<br/>
                                （4）按照相关政府主管部门的要求；<br/>
                                （5）为维护好学家的合法权益。<br/>
                                （6）您同意让第三方共享资料。<br/>
                                （7）我们发现您违反了好学家服务协议或相关规则，根据协议约定或相关规则规定应当披露您的个人信息。<br/>
                                （8）我们需要向代表我们提供产品或服务的公司提供资料（除非我们另行通知你，否则这些公司无权使用你的身份识别资料）。<br/>
                                好学家会始终致力于在充分保护您隐私的前提下，为您提供更优质的体验和服务。<br/>
                                好学家转载作品（包括论坛内容）出于传递更多信息之目的，并不意味好学家（包括好学家关联企业）赞同其观点或证实其内容的真实性。如因作品内容、版权或其他问题需要和本网联系的，请发送信息至好学家微信公众号</dd>
                        <dt>好学家用户诚信公约及违规行为处理办法</dt>
                            <dd>好学家秉承“好教培，上好学”的理念，一直恪守“公正客观”原则，真心爱护着每一位用户，维护我们共同的网络家园，同时好学家也需要大家的共同守护；我们通过尽可能多地提供真实有效的在线课程、丰富的学习资源、有效的评价体系，从而推动形成诚信安全的教育环境！<br/>
                                我们特拟定《好学家用户诚信公约》 ，呼吁广大用户诚信点评、真实点评。<br/>

                                作为好学家会员，我自主维护：<br/>
                                1、维护点评真实性，提倡高质量体验点评；<br/>
                                2、抵制网校炒作，看到不良信息及时向好学家举报。<br/>

                                作为好学家会员，我将远离以下行为：<br/>
                                1、利用点评会员身份要求特权；<br/>
                                2、为获得利益，参与或组织撰写及发布虚假点评或修改点评；<br/>
                                3、散布谣言、夸大或捏造事实，对被评价人进行语言攻击、辱骂的过激行为。<br/>

                                好学家认定的用户严重违规行为有：<br/>
                                1、炒作网校，并向网校收取费用；<br/>
                                2、利用好学家平台中的身份，向网校索要超出正常范围的折扣或优惠，或获得其他不当利益；<br/>
                                3、以盈利为目的组织或参加会员聚会，赚取会员差价或商家回扣；<br/>
                                4、进行其他影响点评公正性、干扰网站秩序的违规行为。<br/>

                                请大家自觉维护好学家诚信点评的纯净空间，杜绝一切炒作行为。我们将根据用户举报及我们所了解到相关的情况，认真严格审核；视情节轻重和具体情况，网站将对有严重违规或有违规重大嫌疑的账号做出但不限于如下的处理：<br/>
                                一、首次违规操作者，违规信息将作屏蔽，视情节轻重发出警告；<br/>
                                二、经警告仍有违规行为的账号，将清除其所有点评，取消点评星级、积分、会员等级，屏蔽其发布的涉及商业性炒作的信息，永久屏蔽账号；<br/>
                                三、被处理的用户可以注册新账号重新使用网站功能，但不得发布与原账号一致、雷同的点评信息；<br/>
                                四、如新账号继续发现有违规操作，将做违规账号处理，同时列入黑名单，谢绝再次使用好学家站一切功能。<br/>
                                非常感谢广大会员对我们的理解和支持。我们邀请广大朋友们同我们一起，共同努力，维护好学家的信息环境，打造最值得消费者信赖的网络教育家园。<br/>
                                欢迎大家继续通过以下渠道向我们举报违规行为：<br/>
                                网站诚信组举报和反馈微信公众号</dd>
                    </dl>
                </article>
                <button
                    onClick={ ()=>{ this.props.getAgreement(false) } } //返回注册界面
                >我已阅读</button>
                <style jsx>{`
                    article {
                        width: 500px;
                        height: 260px;
                        border: 1px solid #ddd;
                        padding: 20px;
                        overflow-y: scroll;
                        left: -38%;
                        position: relative;
                        margin : 10px 0px;
                    }
                        h4 {
                            line-height : 40px;
                        }
                        h5 {
                            text-align : left;
                            line-height : 20px;
                            padding-bottom : 15px;
                        }
                        dl {
                            text-align : left;
                            color : #666;
                            font-size : 12px;
                            line-height : 20px;
                        }
                            dd {
                                padding-bottom : 10px;
                            }
                    button {
                        width : 240px;
                        height : 38px;
                        color : #FFF;
                        font-size : 14px;
                        background-color : #f5a00a;
                        border-radius : 19px;
                    }
                `}</style>
            </div>
        )
    }
}
